// 8位以上，必须包含大小写字母，数字，特殊符号
export const strongPassword = /^(?=.*[0-9])(?=.*[A-Z])(?=.*[a-z])(?=.*[^a-zA-Z0-9]).{8,}$/
// 暂无说明
export const dateFormat = /^[12][0-9]{3}(\/[01][0-9](\/[0123][0-9])*)*$/
// 手机号
export const phone = 11 && /^((13|14|15|17|18)[0-9]{1}\d{8})$/
// 邮箱
export const email = /^\w+@[a-zA-Z0-9]{2,10}(?:\.[a-z]{2,4}){1,3}$/
// 社会信用代码
export const creditCode = /^[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/g
// 身份证号
export const idCard = /^(([1][1-5])|([2][1-3])|([3][1-7])|([4][1-6])|([5][0-4])|([6][1-5])|([7][1])|([8][1-2]))\d{4}(([1][9]\d{2})|([2]\d{3}))(([0][1-9])|([1][0-2]))(([0][1-9])|([1-2][0-9])|([3][0-1]))\d{3}[0-9xX]$/
//  银行卡
export const bank = /^([1-9]{1})(\d{15}|\d{18})$/